<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"53f53c979be385afbe4a605b377591702d01f29cb45619c0bed23d706bcaa755","plan_job_ref":"Job Test actions using target and replace #502 at https://github.com/dflook/terraform-github-actions/actions/runs/15343247377","plan_out_hash":"9d672bd8f8f2a810ed2e5f568ff804253d8d83e57e7f9f54eb73e922b023fdcc","plan_hash":"2853e4138be2c103be208401517748406e78ff26467c5d276fcb93b1ab054cc5","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "XvKIb4ftlq" -> (known after apply)
!~  foreach = "blmnjOOKHM" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #502](https://github.com/dflook/terraform-github-actions/actions/runs/15343247377)